Упражнение 1
Напишите программу, в которой с консоли вводятся значения для двух переменных типа int и одной переменной типа double. Для ввода данных используйте функцию scanf.

Ответ
Упражнение 2
Измените предыдущую программу таким образом, чтобы для считывания данных использовалась не функция scanf(), а функции fgets(), которая считывает строку в буфер, и функцию sscanf(), которая извлекает данные из буфера в переменные.

Ответ
Упражнение 3
Дана следующая программа:

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
#include <stdio.h>
  
int main(void)
{
    int age;
    char name[20];
    // вводим возраст
    printf("Your age: ");
    scanf("%d", &age);
    // вводим имя
    printf("Your name: ");
    scanf("%20s", name);
     
    printf("Name: %s \t Age = %d",name,  age);
    return 0;
}
Эта программа имеет проблему - при вводе имени в переменную name помещается только первая часть имени, которая идет до пробела:

Your age: 34
Your name: Tom Smith
Name: Tom        Age = 34
Исправьте программу таким образом, чтобы она могла принимать в качестве имени строки, разделенные пробелом, например, "Tom Smith".

Ответ
Упражнение 4
Напишите программу, в которой с консоли вводятся высота и ширина прямоугольника, а выводится его площадь.

Ответ
Упражнение 5
В одном метре 3.281 фут. Напишите программу, в которой с консоли вводится размер в футах, а выводится размер в метрах.

Ответ